#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: Thesis
#+TODO: TODO | MAYBE DONE

* TODO [#A] Time Management

** DONE General concepts overview
   <2018-02-26 Mon 10:00-12:00>

** TODO [#C] Implementation in Org-mode studying
   <2018-02-26 Mon 12:00-13:00>

** MAYBE Configuring Gnome3 desktops
   <2018-02-28 Wed 11:30-11:55>
   :PROPERTIES:
   :CATEGORY: Desktop
   :END:
   It might be convinient to allocate the particular window of each
   applicaton on several (appropriate 4) desktops to switch between
   tasks in a smooth manner, just by switching current desktop.

* English
** Grammar
*** TODO Past tenses
    <2018-02-15 Thu 12:00-13:00>
    Elaborate an initial [[file:/usr/local/git/0--key/lib/org/eng_grammar.org::*Past%20simple][org-drill]]
** Vocabulary
** Writing
* Emacs
** Org-mode
*** DONE Calendar
    <2018-02-09 Fri 08:20-08:45>
*** DONE [#B] Agenda rigorous dissection
    <2018-02-26 Mon 16:00-17:00>
    - Export int .ics
    - Import into specific Google Calendar
**** DONE Timestamps
    <2018-02-28 Wed 17:30-18:25> 
**** DONE Creating timestamps
     <2018-02-28 Wed 18:30-18:55>
**** DONE Deadlines and scheduling
     <2018-02-28 Wed 19:00-19:25>
**** DONE Additional state 'MayBe'
     <2018-02-28 Wed 19:30-19:55>
**** DONE Clocking work time
     <2018-03-01 Thu 09:00-09:25>
**** DONE Effort estimates
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 09:39]--[2018-03-01 Thu 09:53] =>  0:14
     :END:
     <2018-03-01 Thu 09:30-09:55>
**** DONE Timers
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 09:59]--[2018-03-01 Thu 10:02] =>  0:03
     :END:
     <2018-03-01 Thu 10:00-10:25>
**** DONE Org-pomodoro
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 10:03]--[2018-03-01 Thu 10:12] =>  0:09
     :END:
     <2018-03-01 Thu 10:30-10:55>
*** TODO Capture
    <2018-02-22 Thu 17:00-18:00>
    Make capture for org-drill items generation with minimal
    interruption
*** TODO Macros
    <2018-02-22 Thu 12:30-13:00>
    To convert =voca-builder= item into =Drill=
** Python-mode
* Programming
** Theory
*** Formal Methods of Software Design
**** TODO Introduction
     <2018-02-13 Tue 08:30-08:55>
**** TODO Extract the binary terminology
     <2018-02-17 Sat 13:30-13:55>
** Practice
*** Data Visualisation
    <2018-02-20 Tue 18:00-19:00>
*** Big data meta-analysis
    <2018-02-27 Tue 17:00-17:55>

